app/controllers/students_controller.rb

	def create
		p "WTF"
		p params[:student]
		p "*" * 50
		@student = Student.create(app_params)
---
INSERT INTO "students" ("created_at", "email", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["created_at", "2014-05-28 21:17:23.287777"], ["email", "gster3000@hotmail.com"], ["updated_at", "2014-05-28 21:17:23.287777"]]