app/controllers/user_steps_controller.rb

SELECT  "students".* FROM "students"  WHERE "students"."id" = $1 LIMIT 1  [["id", 1]]
---
	def show
				p "this is the current user in show"
				p current_user

		@student = Student.find current_user

SELECT  "students".* FROM "students"  WHERE "students"."id" = $1 LIMIT 1  [["id", 1]]
UPDATE "students" SET "age" = $1, "phone_number" = $2, "updated_at" = $3 WHERE "students"."id" = 11  [["age", "2000-01-31"], ["phone_number", ""], ["updated_at", "2014-06-01 03:45:09.967612"]]
---
	def update
		@student = Student.find current_user
		@student.attributes = person_params
		p @student.attributes
		p @student.save